Repository: La-Kiks/my-sym-site
Catalog: project/translations/messages.*.xlf
Languages: fr

# vich_uploader.form_label.delete_confirm
source: Delete?
fr: Supprimer?

# vich_uploader.link.download
source: Download
fr: Télécharger

# app.menu.projects
source: My projects
fr: Mes projets

# app.menu.settings
source: Settings
fr: Paramètres

# app.menu.logout
source: Logout
fr: Se déconnecter

# app.menu.login
source: Login
fr: Se connecter

# app.menu.register
source: Register
fr: S'inscrire

# app.menu.about
source: About me
fr: A propos

# app.connect.alreadylogged
source: Already logged
fr: Déjà connecté

# app.connect.logout
source: Logout
fr: Se déconnecter

# app.connect.password
source: Password
fr: Mot de passe

# app.connect.rememberme
source: Remember me
fr: Se souvenir de moi

# app.connect.forgottenpassword
source: Forgotten password ?
fr: Mot de passe oublié ?

# app.connect.connect
source: Connect
fr: Se connecter

# app.connect.or
source: OR
fr: OU

# app.connect.github
source: Connect with GitHub
fr: Se connecter avec GitHub

# app.connect.gmail
source: Connect with Gmail
fr: Se connecter avec Gmail

# app.register.username
source: Username
fr: Pseudo

# app.register.password
source: Password
fr: Mot de passe

# app.register.confirm.password
source: Confirm password
fr: Confirmer le mot de passe

# app.register.firstname
source: Firstname
fr: Prénom

# app.register.lastname
source: Lastname
fr: Nom

# app.form.errors
source: Errors
fr: Erreurs :

# app.register.register
source: Register
fr: S'inscrire

# app.register.or
source: OR
fr: OU

# app.register.github
source: Register with GitHub
fr: S'inscrire avec GitHub

# app.register.gmail
source: Register with Gmail
fr: S'inscrire avec Gmail

# app.footer.message
source: Thank you for your visit! If you found this site useful or if you wish to support it, your donations are welcome. Your generosity makes all the difference. Thank you for your support !
fr: Merci de votre visite ! Si ce site vous a été utile ou si vous souhaitez le soutenir, vos dons sont les bienvenus. Votre générosité fait toute la différence. Merci pour votre soutien !

# app.password.chosenewpwd
source: Choose a new password
fr: Choisir un nouveau mot de passe

# app.password.newpwd
source: New password
fr: Mot de passe

# app.password.confirm
source: Confirm
fr: Confirmer

# app.password.asktoresetpwd
source: Reset password ?
fr: Réinitialiser le mot de passe ?

# app.password.errors
source: Errors :
fr: Erreurs :

# app.password.reset
source: Reset
fr: Réinitialiser

# app.contact.socials
source: Follow me here :
fr: Suivez moi ici :

# app.contact.contact
source: Contact me using :
fr: Contactez moi via :

# app.contact.send-a-mesage
source: Send a direct message :
fr: Contact rapide :

# app.contact.name
source: Name
fr: Nom

# app.contact.get-a-copy-email
source: Receive a copy of the message
fr: Recevoir une copie via mail

# app.contact.errors
source: _Errors :
fr: Erreurs :

# app.contact.send-mail
source: Send mail
fr: Envoyer un mail

# app.register.success
source: Registration successful !
fr: Enregistrement effectué avec succès !

# app.project.description.symblog
source: The site you are on was made with Symfony, where I tested and implemented many features of the framework.
fr: Le site sur lequel vous êtes, fait avec Symfony où je me suis permis de tester et d'implémenter de nombreuses fonctionnalités du framework.

# app.project.description.prodraft
source: A turn-based game that uses WebSockets to simulate a draft similar to the one found in the game League of Legends.
fr: Un jeu tour par tour qui utilise les websockets pour simuler une draft comme l'on peut trouver dans le jeu League of Legends.

# app.project.description.cooldownsv2
source: A second version of my site Cooldowns using Symfony 7, after having intensively followed the courses on Grafikart.
fr: Une 2ème version de mon site cooldowns en utilisant Symfony 7, après avoir suivi intensivement les cours sur Grafikart.

# app.project.description.cooldownsv1
source: My very first website addresses a need for League of Legends players. It gained some popularity on Reddit at its launch, with 30k monthly users.
fr: Mon tout premier site qui répond à un besoin des joueurs de League of Legends. Le site a eu une petite popularité sur Reddit à son lancement avec 30k utilisateurs mensuels.

# app.project.title.symblog
source: This website / blog
fr: Le site sur lequel vous êtes !

# app.home.kiki.description.part1
source: Focused on back-end development using PHP and Symfony.
fr: Focalisé sur le back-end avec PHP et Symfony.

# app.home.kiki.description.part2
source: I have a passion for learning and improvement and am eager to take on new challenges !
fr: J'ai soif de savoir et recherche de nouveaux défis !

# app.cdv1.context.title
source: Context
fr: Contexte

# app.cdv1.context.part1
source: During my experience in esports on LoL, I identified the need to have access to champion cooldowns in the game to refine strategic choices. I had created a Google Sheets version of a table, but it wasn’t practical to keep it updated, as I had to manually edit it every two weeks based on the patches.
fr: Lors de mon expérience en esport sur LoL, j'avais cerné ce besoin d'avoir accès aux cooldowns des champions du jeu pour affiner ses choix stratégiques. J'avais créé une version Google Sheet d'un tableau, mais il n'était pas pratique à garder à jour, à devoir l'éditer manuellement toutes les 2 semaines en fonction des patchs.

# app.cdv1.context.part2
source: To get started with coding and development, I naturally wanted to build a site that would be a dynamic table linked to the RIOT GAMES API to facilitate updates. This site saw some success at its launch (through Reddit and Twitter) with around
fr: Pour me lancer dans le code et le dév, c'est naturellement que j'ai voulu me lancer dans la construction d'un site qui serait un tableau dynamique avec un lien à l'API de RIOT GAMES pour faciliter les mises à jour. Ce site a connu un petit succès à son lancement (via Reddit et Twitter) avec environ

# app.cdv1.context.part3.underline
source: 30,000 monthly users.
fr: 30 000 utilisateurs mensuels

# app.cdv1.functions.title
source: Features
fr: Fonctionnalités

# app.cdv1.functions.one
source: Game information through a table
fr: Informations du jeu via tableau

# app.cdv1.functions.two
source: Search and perform calculations
fr: Rechercher et effectuer des calculs

# app.cdv1.functions.three
source: Bi-monthly updates via the Riot Games API
fr: Mise à jour bimensuelle via l'API Riot Games

# app.cdv1.conclusion.title
source: Conclusion
fr: Conclusions

# app.cdv1.conclusion.part1
source: Thanks to this project, I realized the difficulty of bringing an idea to life. But also, all that is possible to achieve, to learn, and the pride you feel when you succeed in making that idea a reality.
fr: Grâce à ce projet, j'ai pu me rendre compte de la difficulté de donner vie à une idée. Mais aussi de tout ce qu'il est possible de faire, d'apprendre et de la fierté qu'on ressent quand on réussit à donner vie à cette idée.

# app.cdv1.conclusion.part2
source: Starting with Python helped me since I had already worked with the language during my studies and my LoL career. The most challenging part was definitely setting up with AWS and EC2.
fr: Commencer en Python m'a aidé vu que j'avais déjà touché le langage pendant mes études et ma carrière LoL, la partie la plus difficile a surement été la mise en place avec AWS et EC2.

# app.cdv1.links.title
source: Links
fr: Liens

# app.cdv1.subtitle
source: A website for League of Legends players that allows them to quickly find cooldown information, with automatic updates via API.
fr: Site pour les joueurs de League of legends, qui permet de trouver les informations des 'cooldowns', rapidement, avec mise à jour automatique via API.

# app.prodraft.subtitle
source: A turn-based game that uses WebSockets to simulate a draft, similar to the one in League of Legends.
fr: Jeu tour par tour qui utilise les websockets pour simuler une 'draft', similaire à celle du jeu League of Legends.

# app.prodraft.context.title
source: Context
fr: Contexte

# app.prodraft.context.part1
source: I didn’t invent the concept of prodraft, but I wanted to modernize and update it. It is useful for users participating in amateur tournaments.
fr: Je n'ai pas inventé le concept de prodraft mais j'ai voulu le modernisé et le mettre à jour, il a une utilité pour les utilisateurs qui font des tournois amateurs.

# app.prodraft.context.part2
source: I wanted to try creating a game to learn a new technology and a new programming language, starting from a universe I know well and avoiding making yet another tic-tac-toe or chess game.
fr: J'ai voulu essayer de créer un jeu, pour apprendre une nouvelle techno et un nouveau langage, en partant d'un univers que je connais bien et éviter de créer un énième jeu de morpion ou d'échec.

# app.prodraft.functions.title
source: Features
fr: Fonctionnalités

# app.prodraft.functions.one
source: Draft simulation with animation and sound
fr: Simulation de draft avec animation et son

# app.prodraft.functions.two
source: Different synchronized views
fr: Différentes vues synchronisées

# app.prodraft.functions.three
source: Draft result exportable in CSV
fr: Résultat de la draft en CSV exportable

# app.prodraft.conclusion.part1
source: More than just meeting a need, this site was a way for me to practice with TypeScript and WebSockets.
fr: Plus que de répondre à un besoin ce site était pour moi un moyen de m'entrainer avec Typescript et les websockets.

# app.prodraft.conclusion.part2
source: I took a monorepo approach with three subfolders: common, backend, and frontend, using Next.js for the views. I struggled at first with the sockets in production, but with some effort, I managed to get it working as I wanted.
fr: J'ai pris une approche mono-repo avec 3 sous dossiers : common, backend et frontend en utilisant Next JS pour les vues. J'ai eu du mal au début avec les sockets en prod' mais avec un peu d'huile de coude j'ai réussi à le faire fonctionner comme je voulais.

# app.prodraft.links.title
source: Links
fr: Liens

# app.sym.subtitle
source: My showcase site, which allows me to present my projects as well as test different features of the Symfony framework.
fr: Mon site vitrine, qui permet de présenter mes projets ainsi que de tester différentes fonctionnalités du framework Symfony.

# app.sym.context.title
source: Context
fr: Contexte

# app.sym.context.part1
source: In my quest to improve my PHP skills, I wanted to create this site, similar to a blog. The site is primarily intended to showcase my work as a developer but is also meant to evolve.
fr: Dans ma quête d'améliorer mon php j'ai voulu créer ce site, similaire à un blog. Le site a vocation à représenter mon travail de développeur en priorité mais il est voué à évoluer.

# app.sym.context.part2
source: The goal is to become familiar with Symfony, so I’m testing as many backend features as possible, even if I don’t use them all.
fr: Le but étant de me familiariser avec Symfony, je teste un maximum de fonctionnalités en backend même si je ne les utilise pas toutes.

# app.sym.functions.title
source: Features
fr: Fonctionnalités

# app.sym.functions.one
source: Blog, displaying articles
fr: Blog, affichage d'articles

# app.sym.functions.two
source: Sandbox for testing Symfony
fr: Bac à sable pour tester Symfony

# app.sym.conclusion.part1
source: For this site, I immediately started by setting up Docker for everything, then created a Makefile to use Symfony and other services (phpMyAdmin, MySQL, MailHog). I use Webpack Encore and Tailwind to streamline the frontend.
fr: Pour ce site j'ai immédiatement commencé par Docker l'ensemble puis créer un Makefile afin d'utiliser Symfony et d'autres services (phpmyadmin, mysql, mailhog). J'utilise le Webpack Encore et Tailwind pour faciliter le frontend.

# app.sym.conclusion.part2
source: I have a long list of features that I’ve implemented and used; here are a few: pagination with KNP Paginator, DQL for custom queries, setup of tests to verify the functionality of display and pagination, account creation, login via Gmail and GitHub, setup of EasyAdmin...
fr: J'ai une longue liste des fonctionnalités que j'ai mise en place et utilisé, en voici quelques unes : pagination avec KNP Paginator, DQL pour mes réquêtes personnalisées, mise en place de test pour vérifier le fonctionnement de l'affichage et de la pagination, créations de compte, connexion via gmail et github, mise en place d'EasyAdmin...

# app.sym.links.title
source: Links
fr: Liens

# app.cdv2.subtitle
source: Redesign of the site for LoL players, with more features, improved stability, and responsive design.
fr: Refonte du site pour les joueurs LoL, avec plus de possibilités, stabilité et responsive.

# app.cdv2.context.title
source: Context
fr: Contexte

# app.cdv2.context.part1
source: After progressing in my training (Grafikart), I wanted to redo my first project properly in order to familiarize myself with Symfony.
fr: Après avoir avancé dans ma formation (Grafikart) j'ai voulu refaire au propre mon premier projet afin de ma familiariser avec Symfony.

# app.cdv2.context.part2
source: This new version incorporates most of the feedback I received on V1. It is easier to keep updated, more stable, and responsive.
fr: Cette nouvelle version prend en compte la majorité des feedbacks que j'ai eu sur la V1, elle est plus simple à tenir à jour, plus stable et responsive.

# app.cdv2.functions.title
source: Features
fr: Fonctionnalités

# app.cdv2.functions.one
source: Game information through search
fr: Informations du jeu via recherche

# app.cdv2.functions.two
source: Display of multiple searches and calculations
fr: Affichage de multiples recherches et calculs

# app.cdv2.functions.three
source: Responsive for phones and tablets
fr: Responsive pour les téléphones et tablettes

# app.cdv2.conclusion.part1
source: Satisfied to have put into practice what I’ve learned and to realize how far I’ve come.
fr: Satisfait d'avoir pu mettre en pratique ce que j'ai appris et de me rendre compte du chemin parcouru.

# app.cdv2.conclusion.part2
source: I was able to use Asset Mapper, Stimulus, and Mutation Observer to manage various aspects of the site, such as dual name + calculation search, dynamic addition of elements to the DOM, and autocomplete for search.
fr: J'ai pu utilisé l'Asset Mapper, Stimulus, Mutation Observer pour gérer différents aspects du site comme la double recherche nom + calcul, l'ajout dynamique d'éléments au DOM, l'auto-complete pour la recherche.

# app.cdv2.links.title
source: Links
fr: Liens
